'''///////////////////////////////////
인덱싱 - 문자열의 순서
a = "Life is too short, You need Python"
print(a[1]) = i
print(a[-2]) = o
슬라이싱
[시작:끝:간격]
a = "Life is too short, You need Python"
print(a[0::])
print(a[0:5:])
print(a[3:8:])
print(a[::2])
i를 y로 수정하기
a="pithon"
print(a[0]+"y"+a[2:])
//////////////////////////////////////'''

'''///////////////////////////////////
문자열 포매팅
numbur = 10
day = "three"
a= "i eat %d apple %s days" %(numbur,day)
print(a)
%s - 문자열
%c - 문자 1개
%d - 정수
%f - 부동 소수
%o - 8진수
%x - 16진수
%% - %문자
%s는 뒤에 붙는 값을 무조건 문자로 집어 넣는다
a = "error is %s%%" %(50)
print(a)
///////////////////////////////////////'''

'''////////////////////////////////////
정렬과 공백
a= "%10s jane" % ("hi") - 오른쪽으로 10칸을 띄우고 hi 출력
print(a)
a= "%-10s jane"  % ("hi") - 왼쪽으로 10칸을 띄우고 hi 출력
print(a)
///////////////////////////////////////'''

'''////////////////////////////////////
소수점 표현하기

///////////////////////////////////////'''
a="%0.4f" %(1.23456789)
print(a)
a="%10.6f" %(1.23456789)
print(a)